<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>GNU General Public Licence</title>


</head>


<body>

<pre><b><br> Note about this translation of Avizo pri &#265;i tiu traduko de la<br> GNU General Public License GNUa &#284;enerala Publika Permesilo<br></b><br>This is an unofficial translation &#264;i tiu esperantigo de la &laquo;GNUa<br>of the GNU General Public License &#284;enerala publika permesilo&raquo; ne estas<br>into Esperanto. It was not oficiala. &#284;in ne publikigis &laquo;Free<br>published by the Free Software Software Foundation&raquo; kaj &#285;i ne estas<br>Foundation, and does not legally jura dokumento determinanta<br>state the distribution terms for kondi&#265;ojn por distribuado de<br>software that uses the GNU General programaro la&#365; la &laquo;GNUa &#284;enerala<br>Public License &ndash; only the Publika Permesilo&raquo; &ndash; nur la<br>original English text of the GNU originala anglalingva teksto validas<br>GPL does that. However, we hope por tio. Tamen espereble la traduko<br>that this translation will help helpos la Esperanto-parolantojn pli<br>Esperanto speakers understand the bone kompreni la enhavon de la &laquo;GNUa<br>GNU General Public License better. &#284;enerala publika permesilo&raquo;.<br><br>You can find the official text of La oficialan tekston de la GNUa<br>the GNU General Public License at &#284;enerala Publika Permesilo vidu &#265;e<br> <a target="_blank" href="gpl-en.html">http://www.gnu.org/copyleft/gpl.html</a><br>Translated by Sergei B. Pokrovsky. Elangligis Sergio Pokrovskij.<br></pre>

<h1> GNU General Public License / GNUa &#284;enerala Publika Permesilo
</h1>

<h2> Esperantigo de la versio 2 (Junio 1991)
</h2>

<blockquote> Copyright &copy; 1989, 1991, Free Software
Foundation Inc. <br>

59 Temple Place, Suite 330, Boston, MA 02111-1307 <br>

Usono
  <p> &#264;iu rajtas reprodukti kaj disvastigi ne&#349;an&#285;itajn kopiojn de
&#265;i tiu Permesilo; sed &#349;an&#285;i &#285;in oni ne rajtas. </p>

</blockquote>

<h2> Anta&#365;parolo
</h2>

<p>
La pliparto de la permesiloj pri uzo de programo celas limigi vian
liberon &#285;in kunhavigi kaj modifi. Male, la GNUa &#284;enerala Publika
Permesilo celas garantii vian liberon kunhavigi kaj modifi liberan
programaron &ndash; certigi ke la programaro estu libera por &#265;iuj
uzantoj. &#264;i
tiu &#284;enerala Publika Permesilo validas por pliparto da programaro de
Free
Software Foundation (la Fonda&#309;o de Libera Programaro) kaj por multaj
aliaj programoj kies a&#365;toroj volas &#285;in uzi. (Por alia parto de la
programaro de Free Software Foundation validas, anstata&#365;e,
&laquo;GNU Library
General Public License&raquo;, la <a name="re-lgpl" href="#lgpl">GNUa
&#284;enerala Publika Permesilo Biblioteka [1]</a>.)
Anka&#365; vi povas apliki &#285;in al viaj programoj.
</p>

<p>
Kiam ni parolas pri liberaj programoj, ja temas pri libero, ne pri
prezo.
Niaj &#284;eneralaj Publikaj Permesiloj estas faritaj por disponigi al vi la
liberon
</p>

<ul>

  <li> <a name="re-distribui" href="#distribui">distribui
[2]</a> ekzemplerojn de liberaj programverkoj (kaj postuli pagon
por ili, se vi volas);</li>

  <li> ricevi la fontotekstojn a&#365; povi preni ilin, se vi deziras;</li>

  <li> modifi la programojn a&#365; uzi pecojn el ili en novaj liberaj
programoj;</li>

  <li> kaj scii ke vi rajtas fari tiojn.</li>

</ul>

<p>
Por protekti viajn rajtojn ni devas enkonduki limigojn kiuj malebligu
al
iu ajn rifuzi al vi tiujn rajtojn a&#365; proponi al vi cedi ilin. Tiuj
limigoj esprimi&#285;as en certaj devigoj por vi, se vi distribuas
ekzemplerojn de programo a&#365; se vi modifas ilin.
</p>

<p>
Ekzemple, se vi distribuas ekzemplerojn de tia programo, &#265;u senpage a&#365;
kontra&#365; pago, vi devas pludoni al la ricevantoj &#265;iujn rajtojn je &#285;i,
kiujn vi havas. Vi devas certigi ke anka&#365; la novaj posedantoj ricevu a&#365;
povu havigi al si la fontotekstojn. Kaj vi devas informi ilin pri la
kondi&#265;oj, por ke ili sciu siajn rajtojn.
</p>

<p>
Ni protektas viajn rajtojn en du pa&#349;oj:
</p>

<ol>

  <li> {ni} rezervas {al ni} la <a href="#copy" name="re-copy">a&#365;torrajton [3]</a> je la programoj, kaj</li>

  <li> ni disponigas al vi &#265;i tiun Permesilon, kiu donas al vi
juran eblon <a href="#prod" name="re-prod">reprodukti [4]</a>, distribui kaj/a&#365;
modifi la programojn.</li>

</ol>

<p>
Krome, por protekti la a&#365;torojn kaj nin mem, ni sciigas al &#265;iuj ke
estas
nenia garantio pri la libera programaro. Personoj akirintaj programon
modifitan per tria partio sciu, ke ili ricevis ne la originalon, kaj
tial
la problemoj ka&#365;zitaj de triapartiaj &#349;an&#285;oj ne kompromitu la reputacion
la originala a&#365;toro.
</p>

<p>
Fine, &#265;iun liberan programon konstante minacas
<a href="#pat" name="re-pat">programa patento [5]</a>.
Ni malvolas ke perantoj de libera programo individue akiru patenton je
&#285;i, per tio fakte farante la programon
<a href="#propr" name="re-propr">proprieta [6]</a>. Por malebligi tion
ni klarigis, ke patento estu koncesiita al &#265;ies ajn libera uzo
&ndash; a&#365; tute
ne estu koncesiita.
</p>

<p>
Nun sekvas la precizaj kondi&#265;oj pri reproduktado, distribuado kaj
modifado.
</p>

<h2> La kondi&#265;oj pri reproduktado, distribuado kaj modifado
<br>

la&#365; la GNUa &#284;enerala Publika Permesilo
</h2>

<p>
&sect;0. &#264;i tiu Permesilo validas por ajna programo a&#365; alia verko
entenanta
averton enmetitan de la posedanto de la a&#365;torrajto, dirantan ke &#285;i
estas
distribuebla la&#365; la kondi&#265;oj de &#265;i tiu &#284;enerala Publika Permesilo.
&#264;i-sube &laquo;Programo&raquo; indikas &#265;ian tian programon a&#365;
verkon, kaj &laquo;verko
bazita sur la Programo&raquo; estas a&#365; la Programo mem, a&#365; ia ajn
derivita
verko la&#365; la difino de la le&#285;o pri la a&#365;torrajto
<a href="#deriv" name="re-deriv">[7]</a>: t.e. verko entenata
la Programon a&#365; ties pecon, &#265;u modifitan a&#365; ne, kaj/a&#365; tradukitan en
alian lingvon. (&#264;i tie kaj sube la termino <dfn>modifo</dfn>
kovras, senrezerve,
tradukojn la&#365; la plej &#285;enerala senco.) &#264;i-sube <dfn>vi</dfn>
indikas
koncesiulon de la Permesilo.
</p>

<p>
&#264;i tiu Permesilo ne koncernas realigon de la ceteraj rajtoj, aliaj ol
reproduktado, distribuado kaj modifado. Rulado de la Programo ne estas
limigita, kaj ties eliga&#309;o estas koncernata nur se &#285;ia enhavo
konstituas
verkon bazitan sur la Programo (alie ol pro la fakto ke &#285;i estas
rezulto
de rulo de la Programo). &#264;u tio validas a&#365; ne, dependas de la funkcio
de
la Programo.
</p>

<p>
&sect;1. Vi rajtas sen&#349;an&#285;e reprodukti kaj distribui ekzemplerojn
de la
fontoteksto de la Programo tia kia vi &#285;in ricevis, sur ajna
datumportilo,
kondi&#265;e ke
</p>

<ul>

  <li> &#265;iu ekzemplero havu klare videblan kaj ta&#365;gan avizon pri
la a&#365;torrajto (copyright notice) kaj malgarantiilon (disclaimer of
warranty);</li>

  <li> &#265;iuj avizoj pri &#265;i tiu Permesilo kaj malgarantiiloj restas
netu&#349;itaj;</li>

  <li> kun la ekzemplero de la Programo la akiranto ricevu kopion
de &#265;i tiu Permesilo.</li>

</ul>

<p>
Vi rajtas fakturi la fizikan agon por liverado de ekzemplero de la
Programo, kaj la&#365;vole vi rajtas oferti pagajn servojn garantiajn.
</p>

<p>
&sect;2. Vi rajtas modifi vian ekzemplerojn a&#365; viajn ekzemplerojn
de la
Programo, a&#365; ajnan ties pecon, tiel kreante verkon bazitan sur la
Programo. Vi rajtas reprodukti kaj distribui ekzemplerojn de tia verko
la&#365; la reguloj de &sect;1, se vi anka&#365; plenumas &#265;iujn sekvajn
kondi&#265;ojn:
</p>

<ol type="a">

  <li>la de vi modifitaj dosieroj enhavu bone videblan avizon ke
vi &#349;an&#285;is ilin, kaj la datojn de &#265;iuj &#349;an&#285;oj;</li>

  <li>distribuante a&#365; publikigante ajnan verkon kiu tute a&#365; parte
entenas la Programon a&#365; estas bazita sur la Programo a&#365; ties parto, vi
devas koncesii la rajtojn uzi tiun verkon al &#265;iu tria partio la&#365; la
kondi&#265;oj de &#265;i tiu Permesilo, sen ajna koncesia pago, kaj la verko estu
koncesiata kiel unu tuto;</li>

  <li>se dum la normala uzmaniero de la modifita programo &#285;i
dialoge legas komandojn, vi devas zorgi ke &#285;i, lan&#265;ite en la plej
kutima maniero por dialoga uzo, eligu anoncon kiu entenu:
    <ul>

      <li> avizon pri la a&#365;torrajto;</li>

      <li> malgarantiilon (a&#365; male, informon ke vi provizas
garantion);</li>

      <li> permeson al la uzantoj plu distribui la Programon sub
&#265;i tiuj kondi&#265;oj, kaj indikon kiel la uzanto povas vidi kopion de &#265;i
tiu Permesilo.</li>

    </ul>

(Escepto: se la Programo mem estas dialoga sed normale ne eligas tian
anoncon, tiam anka&#365; por via derivita verko tia anonco ne estas deviga.)</li>

</ol>

<p>
Tiuj postuloj rilatas al la modifita verko konsiderata kiel unu tuto.
Se
apartigeblaj komponantoj de la verko ne estas derivitaj el la Programo,
kaj sencas uzi ilin kiel sendependajn kaj apartajn verkojn, tiam &#265;i tiu
Permesilo ne koncernas tiujn komponantojn en la okazoj kiam vi
distribuas
ilin kiel apartajn verkojn. Sed kiam vi distribuas tiujn samajn
komponantojn kiel parton de tuto estanta verko bazita sur la Programo,
tiam la distribuado de tiu tuto obeu la regulojn de &#265;i tiu Permesilo,
kaj
la rajtoj akirataj de la pluaj koncesiuloj surbaze de &#265;i tiu Permesilo
etendi&#285;as &#285;is la plena tuto, inklude &#265;iujn ties partojn, sendepende
tion,
kiu a&#365;toris ilin.
</p>

<p>
Do, la motivo de &#265;i tiu &sect;2 ne estas akiri a&#365; kontesti viajn la
rajtojn je
verko kiun vi a&#365;toras; la celo estas realigi la rajton determini la
manieron distribui la derivitajn a&#365; kolektivajn verkojn bazitajn sur la
Programo.
</p>

<p>
Simpla kunesto de alia verko, ne bazita sur la Programo, apud la
Programo
(a&#365; apud verko bazita sur la Programo) sur unu sama datumportilo memora
a&#365; distribua ne etendas la kondi&#265;ojn de &#265;i tiu Permesilo sur tiun alian
verkon.
</p>

<p>
&sect;3. Vi rajtas reprodukti kaj distribui ekzemplerojn de la
Programo (a&#365; de
verko bazita sur la Programo, la&#365; &sect;2) en celkodo a&#365; en formo
de
plenumebla programo la&#365; la reguloj de &sect;&sect;1 kaj 2
&#265;i-supre, kondi&#265;e ke vi
anka&#365; plenumas iun el la sekvaj postuloj:
</p>

<ol type="a">

  <li>la ekzempleron akompanu la responda kompleta fontoteksto en
komputile legebla formo, distribuenda la&#365; la reguloj de
&sect;&sect;1 kaj 2 &#265;i-supre, sur datumportilo kutime uzata por
inter&#349;an&#285;i programaron; a&#365;</li>

  <li>la ekzempleron akompanu skribita oferto, valida por almena&#365;
3 jaroj, disponigi al ajna tria partio, kontra&#365; pago ne pli granda ol
via kosto de fizika transmeto, ekzempleron de kompleta responda
komputile legebla fontoteksto distribuenda la&#365; la reguloj de
&sect;&sect;1 kaj 2 &#265;i-supre, sur datumportilo kutime uzata por
inter&#349;an&#285;i programaron; a&#365;</li>

  <li>la ekzempleron akompanu la de vi ricevita informo pri
distribuado de la responda fontoteksto. (Tiu opcio validas nur okaze de
nekomerca distribuado kaj nur se vi ricevis la programon en celkodo a&#365;
en formo de plenumebla programo, akompanitan de tia oferto la&#365;
&sect;3.b de &#265;i tiu Permesilo.)</li>

</ol>

<p>
La fontoteksto de verko estas tiu &#285;ia formo, kiu plej oportunas por
modifado. La kompleta fontoteksto de plenumebla verko estas &#265;iuj
fontotekstoj de &#265;iuj komponantaj moduloj, plus &#265;iuj dosieroj difinantaj
interfacojn, plus la skriptoj uzataj por regi tradukadon kaj instaladon
de la plenumebla programo. Tamen, per speciala escepto, en la
distribuata fontoteksto povas foresti &#265;io normale kundistribuata (&#265;u en
formo de fontoteksto a&#365; kiel plenumebla programo) por la bazaj
komponantoj (programlingva tradukilo, operaciuma kerno ktp) de la
operaciumo per kiu ruli&#285;as la plenumebla programo &ndash; krom se
tia
komponanto mem apartenas al la plenumebla programo.
</p>

<p>
Se distribuado de la verko en formo de plenumebla programo a&#365; celkodo
okazas per atingebligo por kopiado el difinita loko, tiam disponigo de
egala atingeblo por kopii fontotekston el la sama loko plenumas la
postulon pri liverado de la fontoteksto, e&#265; malgra&#365; ke la tria partio
ne
estas devigata kopii la fontotekston kun la celkodo.
</p>

<p>
&sect;4. Vi ne rajtas reprodukti, modifi, subkoncesii a&#365; distribui
la
Programon alie ol la&#365; la malimplicaj reguloj de &#265;i tiu Permesilo. &#264;ia
provo alimaniere reprodukti, modifi, subkoncesii a&#365; distribui la
Programon estas nevalida kaj a&#365;tomate estingas &#265;iujn viajn rajtojn
donitajn per &#265;i tiu Permesilo. Tamen la rajtoj de la partioj ricevintaj
de vi ekzemplerojn de la Programo a&#365; rajtojn la&#365; &#265;i tiu Permesilo plu
validas, dum ili mem observas la kondi&#265;ojn de la Permesilo.
</p>

<p>
&sect;5. Ne estas postulate ke vi akceptu &#265;i tiun Permesilon, &#265;ar
vi &#285;in ne
subskribis. Tamen nenio alia rajtigas vin modifi a&#365; distribui la
Programon a&#365; verkojn el &#285;i derivitajn. Tiajn agojn malpermesas la le&#285;o,
krom se vi akceptas la Permesilon. Tial, se vi modifas a&#365; distribuas
ekzemplerojn de la Programo (a&#365; de verko bazita sur la Programo), vi
per
tio indikas vian akcepton de la rajtigo per la Permesilo fari tion, kaj
la akcepton de &#265;iuj &#285;iaj kondi&#265;oj kaj reguloj pri reprodukto,
distribuado
kaj modifado de la Programo a&#365; de verkoj sur &#285;i bazitaj.
</p>

<p>
&sect;6. &#264;iufoje kiam vi pludistribuas la Programon (a&#365; verkon
bazitan sur la
Programo), la ricevanto a&#365;tomate ricevas permeson reprodukti, distribui
a&#365; modifi la Programon la&#365; la kondi&#265;oj kaj reguloj de &#265;i tiu Permesilo.
Vi ne rajtas aldoni iajn ajn kromajn limigojn je la rajtoj de la
ricevanto provizitaj per &#265;i tiu Permesilo. Vi ne responsas pri obeigo
de
triaj partioj al &#265;i tiu Permesilo.
</p>

<p>
&sect;7. Se, sekve de ju&#285;a decido, a&#365; de plendo pri rompo de
patenta rajto, a&#365;
pro alia ka&#365;zo (ne nepre ligita al la patenta juro), vi trafas sub
devigon (&#265;u per ju&#285;a decido, kontrakto a&#365; alie), kiu kontra&#365;as al la
kondi&#265;oj de &#265;i tiu Permesilo, tio ne rajtigas vin malobei la kondi&#265;ojn
de
&#265;i tiu Permesilo. Se vi ne povas distribui plenumante kaj la kondi&#265;ojn
de &#265;i tiu Permesilo, kaj viajn aliajn koncernajn devigojn, tiam vi
neniel
povas &#285;in distribui. Ekzemple, se patenta permesilo malebligas al la
subkoncesiuloj, akirintaj ekzemplerojn de la Programo rekte de vi a&#365;
per
tria partio, &#285;in senhonorarie pludistribui, tiam vi nur povas rezigni
pri
distribuado de la Programo.
</p>

<p>
Se iu postulo de &#265;i tiu paragrafo i&#285;as nevalida a&#365; neplenumebla &#265;e
esti&#285;o
de iuj specialaj cirkonstancoj, apliki&#285;u la resto de &#265;i tiu paragrafo
sen
tiu postulo. &#264;i tiu paragrafo apliki&#285;as plene
<a href="#cxeso" name="re-cxeso">{post la &#265;eso de tia
cirkonstanco a&#365;} [8]</a> se malestas tiaj cirkonstancoj.
</p>

<p>
Ne estas celo de &#265;i tiu &sect;7 instigi vin rompi patentojn a&#365;
aliajn
pretendojn je proprieto a&#365; kontesti validon de tiaj pretendoj; la sola
celo estas protekti la integron de la sistemo de distribuado de libera
programaro, sistemo funkcianta per publikaj permesiloj. Multaj homoj
malavare kontribuis al la kreo de ri&#265;a gamo da programaro distribuata
per
tiu sistemo, fidante je &#285;ia konsekvenca aplikado; la rajto elekti la
sistemon de distribuado de programverko apartenas al la a&#365;toro /
donanto,
kaj ne koncesiulo &#285;in altrudu.
</p>

<p>
La intenco de &#265;i tiu &sect;7 estas klare prezenti, kiajn
konsekvencojn celas
estigi la ceteraj partoj de &#265;i tiu Permesilo.
</p>

<p>
&sect;8. Se distribuadon kaj/a&#365; uzadon de la Programo en iuj landoj
limigas
patentoj a&#365; interfacoj kovritaj per a&#365;torrajto, la praposedanto de la
a&#365;torrajto, metanta la Programon sub la kondi&#265;ojn de &#265;i tiu Permesilo,
rajtas malimplice limigi la teritorion de distribuado de la Programo,
ekskludante tiajn landojn, tiel ke la distribuado estu permesita nur en
a&#365; inter la landoj ne tu&#349;itaj per tia limigo. En tia okazo la koncerna
limigo estu rigardata kiel unu el la kondi&#265;oj de &#265;i tiu Permesilo.
</p>

<p>
&sect;9. La&#365;bezone &laquo;Free Software Foundation&raquo;
rajtas publikigi reviziitajn
kaj/a&#365; novajn versiojn de la &#284;enerala Publika Permesilo. Tiaj versioj
konservos la bazajn principojn de &#265;i tiu versio, sed povas diferenci en
detaloj, responde al novaj problemoj a&#365; situacioj.
</p>

<p>
&#264;iu versio ricevas sian propran numeron. Se la Programo indikas, ke &#285;i
estas submetita al &#265;i tiu Permesilo en ties difinita versinumero
&laquo;a&#365; ajna
posta versio&raquo; (&laquo;any later version&raquo;), tiam
vi rajtas, la&#365;pla&#265;e, sekvi a&#365;
la kondi&#265;ojn kaj regulojn de la indikita versio, a&#365; tiujn de ajna pli
malfrua versio publikigita de &laquo;Free Software
Foundation&raquo;. Se la Programo
ne indikas versinumeron, vi rajtas elekti iun ajn version iam ajn
publikigitan de &laquo;Free Software Foundation&raquo;.
</p>

<p>
&sect;10. Se vi volas uzi partojn de la Programo en aliaj
programoj, kies
distribuaj kondi&#265;oj diferencas, skribe petu permeson de la a&#365;toro. Por
programaro kies a&#365;torrajton tenas &laquo;Free Software
Foundation&raquo;, petu
permeson de &laquo;Free Software Foundation&raquo;; iam &#285;i
faras esceptojn pri tio.
La decidojn de &laquo;Free Software Foundation&raquo; motivas
du celoj: konservi la
liberon de &#265;iu verko derivita el nia libera programaro, kaj &ndash;
&#285;enerale
&ndash; helpi kunhavigon kaj reuzon de programaro.
</p>

<h2> Malgarantiilo
</h2>

<p>
&sect;11. <em>&#264;ar la Programo estas koncesiata senpage, al
&#285;i apliki&#285;as nenia
garantio, kiom tion permesas la koncerna le&#285;o. Krom se alio estas
malimplice indikita en skriba formo, la tenantoj de la a&#365;torrajto
kaj/a&#365;
aliaj partioj disponigas la Programon &laquo;tia, kia &#285;i
estas&raquo; (&laquo;as is&raquo;) sen
ia ajn garantio, nek esprimita nek implica, interalie sen la implica
garantio pri surmerkatigeblo, a&#365; ta&#365;geco por konkreta uzo. La tuta
risko
koncerne la kvaliton kaj funkcikapablon de la programo estas via. Se la
programo montri&#285;os difekta, vi portos la kostojn de &#265;iuj necesaj
servoj,
riparo a&#365; korekto.</em>
</p>

<p>
&sect;12. <em>Neniokaze, krom se alion postulas aplikebla
le&#285;o a&#365; skribita
interkonsento, neniu tenanto de la a&#365;torrajto a&#365; alia partio rajtigita
modifi kaj/a&#365; pludistribui la Programon la&#365; la &#265;i-supraj permesoj, ne
responsos al vi pro la dama&#285;oj, inklude &#285;eneralajn, specialajn,
akcidentajn a&#365; malrektajn, rezultantaj el uzo a&#365; maleblo uzi la
Programon (interalie, perdon a&#365; difekton de datumoj, a&#365; perdojn
suferitajn de vi a&#365; de triaj partioj, a&#365; nekapablo de la Programo
kunlabori kun iuj ajn aliaj programoj) &ndash; e&#265; se tiaj tenanto
a&#365; alia
partio estis avertitaj pri la eblo de tiaj dama&#285;oj.</em>
</p>

<h3> Fino de la reguloj kaj kondi&#265;oj
</h3>

<h2> Aldono:<br>

Kiel apliki tiujn regulojn al viaj novaj programoj
</h2>

<p>
Se vi verkas novan programon kaj volas fari &#285;in kiel eble plej uzebla
por
la socio, la plej bona maniero atingi tion estas fari &#285;in libera, kaj
tiam &#265;iu povos &#285;in pludistribui kaj modifi la&#365; la kondi&#265;oj de &#265;i tiu
Permesilo.
</p>

<p>
Tiucele, aldonu al la programo la sekvajn avizojn. Plej sekure estas
meti ilin komence de &#265;iu fonta dosiero, por plej klare averti pri
malesto
de garantioj; kaj &#265;iu dosiero enhavu almena&#365; la linion kun la
a&#365;torrajta
signo kaj referencon al la plena teksto de la avizo:
</p>

<pre>&lt;unu linio kun la nomo de la programo kaj resumo de &#285;ia funkcio&gt;<br>Copyright &copy; &lt;jaro&gt; &lt;nomo la la a&#365;toro&gt;<br><br>This program is free software; you &#264;i tiu verko estas libera programo;<br>can redistribute it and/or modify vi povas &#285;in pludistribui kaj/a&#365;<br>it under the terms of the GNU modifi je la kondi&#265;oj de la GNUa<br>General Public License as published &#284;enerala Publika Permesilo, eldonita<br>by the Free Software Foundation; de &laquo;Free Software Foundation&raquo;, la&#365;<br>either version 2 of the License, or la versio 2 de tiu Permesilo a&#365;, se<br>(at your option) any later version. vi preferas, ajna posta versio.<br><br>This program is distributed in the Ni distribuas &#265;i tiun programon<br>hope that it will be useful, but esperante ke &#285;i estos utila, tamen<br>WITHOUT ANY WARRANTY; without even SEN IA AJN GARANTIO, i.a. sen la<br>the implied warranty of implica garantio pri SURMERKATIGEBLO<br>MERCHANTABILITY or FITNESS FOR A a&#365; TA&#364;GECO POR IU KONKRETA CELO.<br>PARTICULAR PURPOSE. See the GNU Pliajn detalojn vidu en la GNUa<br>General Public License for more &#284;enerala Publika Permesilo.<br>details.<br><br>You should have received a copy of Ekzemplero de la GNUa &#284;enerala<br>the GNU General Public License Publika Permesilo devas esti<br>along with this program; if not, liverita al vi kun &#265;i tiu programo;<br>write to the se vi &#285;in ne ricevis, turnu vin al<br><br> Free SoftwareFoundation, Inc.,<br> 59 Temple Place, Suite 330,<br> Boston, MA 02111-1307<br> USA<br></pre>

<p>
Krome, indiku kiel eblas vin kontakti per la reta a&#365; papera po&#349;to.
</p>

<p>
Se la programo estas dialoga, zorgu ke &#285;i eligu mallongan avizon, kiel
la
&#265;i-suba ekzemplo, &#265;e startigo en la interaga re&#285;imo:
</p>

<pre> Gnomovido, versio 69. A&#365;torrajto &copy; &lt;jaro&gt; &lt;a&#365;tornomo&gt;<br> Gnomovido estas distribuata SEN IA AJN GARANTIO;<br> por vidigi detalojn tajpu &laquo;show w&raquo;.<br> Tio estas libera programo, kaj bonvenas &#285;ia distribuado la&#365; certaj<br> kondi&#265;oj; por vidigi detalojn tajpu &laquo;show c&raquo;.<br></pre>

<p>
La proponitaj komandoj &laquo;show w&raquo; kaj &laquo;show
c&raquo; devus surekranigi la
koncernajn partojn de la &#284;enerala Publika Permesilo. Kompreneble, ili
povas havi aliajn nomojn; ili e&#265; povas esti musklakoj a&#365; menueroj
&ndash; io
ajn konvena al via programo.
</p>

<p>
Se necesas, vi devas anka&#365; ricevi de via dunganto (se vi estas dungita
programisto) a&#365; eventuale de reprezentanto de via
<a href="#dungo" name="re-dungo">lernejo [9]</a> skriban
malpretendon je la a&#365;torrajto. Vi povas uzi &#265;i-suban modelon, konvene
&#349;an&#285;inte la nomojn:
</p>

<blockquote> La firmao &laquo;ABC&#264;&raquo; per &#265;i tio
rezignas pri &#265;iaj proprietaj rajtoj je la programo
&laquo;Gnomovido&raquo; (faranta pasa&#309;ojn por tradukiloj)
verkita de Pro Gramisto.
  <p> &lt;subskribo de Mag Nato&gt;, la 1an de aprilo 3001<br>

Mag Nato, Prezidanto </p>

</blockquote>

<p>
&#264;i tiu &#284;enerala Publika Permesilo malebligas inkludigi vian programon
en
proprietan programaron. Se via programo estas biblioteko da
subprogramoj,
vi eble ju&#285;os pli utila permesi bindi proprietajn aplika&#309;ojn kun la
biblioteko. Se vi volas tion, anstata&#365; &#265;i tiun Permesilon uzu la GNUan
&#284;eneralan Publikan Permesilon Bibliotekan.
</p>

<h2> Notoj de la tradukinto
</h2>

<p>
<a name="lgpl" href="#re-lgpl">[1]</a>
Lastatempe FSF preferas
nomi tiun permesilon ne &laquo;biblioteka&raquo; sed
&laquo;malplia&raquo; a&#365; &laquo;reduktita&raquo;
(GNU Lesser General Public License); &#265;e tio la angla siglo restas la
sama (LGPL).
</p>

<p>
<a href="#re-distribui" name="distribui">[2] Distribui</a> programon:
disponigi atingon al ekzemplero de programo en
ajna formo por <a href="#prod" name="re-prod">reproduktado [4]</a>,
interalie per la Reto, vendo, ludono, pruntedono ktp.
</p>

<p>
<a href="#re-copy" name="copy">[3]</a> Anglalingve temas pri
&laquo;copyright&raquo;, kaj &laquo;kopirajto&raquo; ja
ekzistas en
Esperanto; tamen la termino &laquo;a&#365;torrajto&raquo; &#349;ajnas iom
preferata. &ndash; La
angla teksto estas iom malklara: kiu i&#285;as la tenanto de la a&#365;torrajto,
&#265;u
nepre FSF a&#365; eventuale iu alia, ekz-e la a&#365;toro mem? La gramatiko de &#265;i
tiu loko pensigas ke temas pri transdono de la a&#365;torrajto al FSF; sed
en
la postaj rekomendoj ni vidas modelan ekzemplon
</p>

<blockquote> Gnomovido, versio 69. A&#365;torrajto &copy;
&lt;jaro&gt; &lt;a&#365;tornomo&gt;
</blockquote>

<p>
A&#365; eble &laquo;ni&raquo; estas ne FSF sed
&laquo;oni&raquo;?
</p>

<p>
<a href="#re-prod" name="prod">[4]</a> La originalo &#265;iam parolas pri
&laquo;copying&raquo;, tamen en la a&#365;torrajta juro
la jura termino estas &laquo;reprodukti&raquo;: Reproduktado de
programo estas farado
de unu a&#365; pli ol unu ekzempleroj de la programo sur ajna datumportilo,
inklude registradon de la programo en komputilan memoron.
</p>

<p>
<a href="#re-pat" name="pat">[5]</a> La Usona juro ebligas patenti
certajn programojn (Software Patents).
</p>

<p>
<a href="#re-propr" name="propr">[6]</a> Proprieta rajto je programo estas
la ekskluziva rajto plenumi kaj/a&#365; permesi plenumi la sekvajn agojn:
</p>

<ul>

  <li> publikigi programon;</li>

  <li> reprodukti programon, plene a&#365; parte, en ajna formo;</li>

  <li> distribui la programon;</li>

  <li> modifi la programon (inklude tradukon en aliajn lingvojn);</li>

  <li> kaj aliajn agojn menciitajn en la koncerna le&#285;o.</li>

</ul>

<p>
<a href="#re-deriv" name="deriv">[7]</a> &laquo;derivative work under
copyright law&raquo;, termino de la Usona le&#285;o.
</p>

<p>
<a href="#re-cxeso" name="cxeso">[8]</a> La teksto intervinkula
en la originalo malestas, sed estus
memtrudi&#285;anta en la responda teksto rusa (kaj enestas en la rusa
traduko).
</p>

<p>
<a href="#re-dungo" name="dungo">[9]</a> Postulo de Usona le&#285;o. Sed
ekz-e en Ruslando nur la dunganto povas
a&#365;tomate ricevi la a&#365;torrajton je via verko, kaj nur je verko ofice
komisiita al vi (krom se la dunga kontrakto anta&#365;vidis alion).
</p>

<h2> Tradukproblemoj
</h2>

<p>
&#264;i tio estas mia unua teksto jura, kaj super &#265;io la originalo estas en
fremda lingvo. Pri la senco de kelkaj lokoj mi havas dubojn.
</p>

<dl>

  <dt>En &sect;11</dt>

  <dd>The entire risk as to the quality and PERFORMANCE of the
program is with you.<br>

La tuta risko koncerne la kvaliton kaj FUNKCIKAPABLON de la programo
estas via. <br>

{Normale PERFORMANCE signifus &laquo;rendimento&raquo;, sed la
kunteksto &#349;ajnas
postuli funkcikapablon, kiel en la traduko germana
(Leistungsf&auml;higkeit);
cetere mi atendus &#285;in unualoke, kaj nur poste zorgus pri kvalito.} </dd>

  <dt>En &sect;12</dt>

  <dd>including any GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL
damages<br>

dama&#285;oj, inklude &#284;ENERALAJN, SPECIALAJN, AKCIDENTAJN a&#365; MALREKTAJN <br>

{Mi tradukis &laquo;la&#365;vorte&raquo;, sen bone kompreni kio
estas tiuj &laquo;specialaj
dama&#285;oj&raquo; ktp; la rusa traduko &#265;i tie parolas pri
&laquo;&#285;eneralaj (&#265;u sumaj?),
realaj, anta&#365;videblaj kaj malrektaj dama&#285;oj&raquo;; la germana
traduko, pri
&laquo;allgemeiner oder spezieller Sch&auml;den,
Sch&auml;den durch Seiteneffekte
(Nebenwirkungen) oder Folgesch&auml;den&raquo;; la ceteraj
tradukoj, same papage
kiel mi.} </dd>

  <dt>(garantio pri) surmerkatigeblo </dt>

  <dd>tiel mi tradukis &laquo;merchantability&raquo;.
En la germana traduko, &laquo;Marktreife&raquo;; ruse,
proksimume, &laquo;var/ec/o,
var/esto, var/statuso&raquo;; france
&laquo;commercialisation&raquo;. </dd>

</dl>

</body>
</html>
