<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>Licencia P&uacute;blica General</title>


</head>


<body>

<h3><font face="Verdana" size="2">Licencia
P&uacute;blica General</font></h3>

<p>
<font face="Verdana" size="2">Versi&oacute;n 2,
Junio de 1991<br>

Traducci&oacute;n al Espa&ntilde;ol : Diciembre de 2001 por<br>

Jos&eacute; Mar&iacute;a Sar&aacute;chaga Fischer:
jmsarachaga at garaitia dot com
</font></p>

<p>
<font face="Verdana" size="2"><b>Contribuciones:</b><br>

13-Dic-2002 Fabi&aacute;n Rodr&iacute;guez
www.fabianrodriguez.com
</font></p>

<p>
<font face="Verdana" size="1"> &gt; <a href="#preambulo">pre&aacute;mbulo</a><br>

&gt; <a href="#terminos">t&eacute;rminos
y condiciones</a><br>

&gt; <a href="#aplicacion">c&oacute;mo
aplicar esta licencia</a></font></p>

<font face="Verdana" size="1"><font size="3">
</font></font>
<hr><font face="Verdana" size="1"><font size="3"><tt>This is an unofficial
translation of the GNU General Public License into spanish. It was not
published by the Free Software Foundation, and does not legally state
the distribution terms for software that uses the GNU GPL--only the
original English text of the GNU GPL does that. However, we hope that
this translation will help spanish speakers understand the GNU GPL
better.<br>

</tt></font></font>
<hr width="60%"><font face="Verdana" size="1"><font size="3"><tt>Esta es una traducci&oacute;n
NO oficial de la "GNU General Public License" al espa&ntilde;ol. No
fu&eacute;
publicada por la "FSF Free Software Foundation", y no respalda
legalmente los t&eacute;rminos de distribuci&oacute;n del
software que utiliza la
"GNU GPL", s&oacute;lo el texto original en ingl&eacute;s lo
hace. Sin embargo
esperamos que esta traducci&oacute;n ayude a las personas de habla
hispana a
entender mejor la "GPL".<br>

</tt></font></font>
<hr>
<p><font face="Verdana" size="1"><font face="Verdana" size="2">
Copyright (C) 1989, 1991 Free Software Foundation, Inc.<br>

59 Temple Place - Suite 330, Boston, MA 02111-1307, USA
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Toda
persona tiene permiso de copiar y distribuir copias fieles de este
documento de licencia, pero no se permite hacer modificaciones.
</font></font></p>

<p><font face="Verdana" size="1"><font face="Verdana" size="2"><br>

<br>

</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><a name="preambulo"></a><font size="3"><b>PREAMBULO</b></font>
</font></font></p>

<hr>
<font face="Verdana" size="1"><font face="Verdana" size="2">Los
contratos de licencia de la mayor parte del software est&aacute;n
dise&ntilde;ados
para quitarle su libertad de compartir y modificar dicho software. En
contraste, la "GNU General Public License" pretende garantizar su
libertad de compartir y modificar el software "libre", esto es para
asegurar que el software es libre para todos sus usuarios. Esta
licencia p&uacute;blica general se aplica a la mayor&iacute;a
del software de la "FSF
Free Software Foundation" (Fundaci&oacute;n para el Software Libre)
y a
cualquier otro programa de software cuyos autores as&iacute; lo
establecen.
Algunos otros programas de software de la Free Software Foundation
est&aacute;n cubiertos por la "LGPL Library General Public License"
(Licencia
P&uacute;blica General para Librer&iacute;as), la cual puede
aplicar a sus programas
tambi&eacute;n.
</font></font>
<p><font face="Verdana" size="1"><font face="Verdana" size="2">Cuando
hablamos de software libre, nos referimos a libertad, no precio.
Nuestras licencias "General Public Licenses" est&aacute;n
dise&ntilde;adas para
asegurar que:
</font></font></p>

<ol>

  <font face="Verdana" size="1"><font face="Verdana" size="2"> <li> usted tiene la
libertad de distribuir copias del software libre (y cobrar por ese
sencillo servicio si as&iacute; lo desea) </li>

  <li> recibir el c&oacute;digo fuente (o tener la
posibilidad de obtenerlo si as&iacute; lo desea) </li>

  <li> que usted puede modificar el software o utilizar partes de
el en nuevos programas de software libre </li>

  <li> que usted est&eacute; enterado de que tiene la
posibilidad de hacer todas estas cosas. </li>

  </font></font>
</ol>

<font face="Verdana" size="1"><font face="Verdana" size="2">Para
proteger sus derechos, necesitamos hacer restricciones que prohiban a
cualquiera denegarle estos derechos o a pedirle que renuncie a ellos.
Estas restricciones se traducen en algunas responsabilidades para usted
si distribuye copias del software, o si lo modifica.
</font></font>
<p><font face="Verdana" size="1"><font face="Verdana" size="2">Por
ejemplo, si usted distribuye copias de un programa, ya sea
gratuitamente o por algun importe, usted debe dar al que recibe el
software todos los derechos que usted tiene sobre el mismo. Debe
asegurarse tambi&eacute;n que reciban el c&oacute;digo fuente o
bi&eacute;n que puedan
obtenerlo si lo desean. Y por &uacute;ltimo debe mostrarle a esa
persona estos
t&eacute;rminos para que conozca los derechos de que goza.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Nosotros
protegemos sus derechos en 2 pasos: (1) protegiendo los derechos de
autor del software y (2) ofreciendole este contrato de licencia que le
otorga permiso legal para copiar, distribuir y modificar el software.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Adem&aacute;s,
para la protecci&oacute;n de los autores de software y la nuestra,
queremos
asegurarnos de que toda persona entienda que no existe ninguna
garant&iacute;a
del software libre. Si el software es modificado por alguien y lo
distribuye, queremos que quienes lo reciban sepan que la copia que
obtuvieron no es la original, por lo que cualquier problema provocado
por quien realiz&oacute; la modificaci&oacute;n no
afectar&aacute; la reputaci&oacute;n del autor
original.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Finalmente,
cualquier programa de software libre es constantemente amenazado por
las patentes de software. Deseamos evadir el peligro de que los
re-distribuidores de un programa de software libre obtenga
individualmente los derechos de patente con el fin de volver dicho
programa propietario. Para prevenir esto, hemos dejado en claro que
cualquier patente deber&aacute; ser licenciada para el uso libre de
toda
persona o que no est&eacute; licenciada del todo.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">A
continuaci&oacute;n se describen con precisi&oacute;n los
t&eacute;rminos y condiciones para copiar, distribuir y modificar
el
software.
</font></font></p>

<p><font face="Verdana" size="1"><font face="Verdana" size="2"><br>

<br>

</font></font></p>

<p>
</p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><a name="terminos"></a><font size="3"><b>TERMINOS Y CONDICIONES PARA COPIA,
MODIFICACION Y DISTRIBUCION</b></font>
</font></font></p>

<hr>
<p><font face="Verdana" size="1"><font face="Verdana" size="2"><font size="4"><b>0.</b></font>
Esta licencia aplica a cualquier programa o trabajo que contenga una
nota puesta por el propietario de los derechos del trabajo
estableciendo que su trabajo puede ser distribuido bajo los
t&eacute;rminos de
esta "GPL General Public License". El "Programa", utilizado en lo
subsecuente, se refiere a cualquier programa o trabajo original, y el
"trabajo basado en el Programa" significa ya sea el Programa o
cualquier trabajo derivado del mismo bajo la ley de derechos de autor:
es decir, un trabajo que contenga el Programa o alguna
porci&oacute;n de el,
ya sea &iacute;ntegra o con modificaciones y/o traducciones a otros
idiomas.
De aqu&iacute; en adelante "traducci&oacute;n"
estar&aacute; incluida (pero no limitada a)
en el t&eacute;rmino "modificaci&oacute;n", y la persona a la
que se aplique esta
licencia ser&aacute; llamado "usted".
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Otras
actividades que no sean copia, distribuci&oacute;n o
modificaci&oacute;n no est&aacute;n
cubiertas en esta licencia y est&aacute;n fuera de su alcance. El
acto de
ejecutar el programa no est&aacute; restringido, y la salida de
informaci&oacute;n
del programa est&aacute; cubierta s&oacute;lo si su contenido
constituye un trabajo
basado en el Programa (es independiente de si fue resultado de ejecutar
el programa). Si esto es cierto o no depende de la funci&oacute;n
del
programa.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><font size="4"><b>1.</b></font>
Usted puede copiar y distribuir copias fieles del c&oacute;digo
fuente del
programa tal como lo recibi&oacute;, en cualquier medio, siempre
que
proporcione de manera conciente y apropiada una nota de derechos de
autor y una declaraci&oacute;n de no garant&iacute;a,
adem&aacute;s de mantener intactas
todas las notas que se refieran a esta licencia y a la ausencia de
garant&iacute;a, y que le proporcione a las dem&aacute;s
personas que reciban el
programa una copia de esta licencia junto con el Programa.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Usted puede
aplicar un cargo por el acto f&iacute;sico de transferir una copia,
y ofrecer
protecci&oacute;n de garant&iacute;a por una cuota, lo cual no
compromete a que el
autor original del Programa responda por tal efecto.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><font size="4"><b>2.</b></font>
Usted puede modificar su copia del Programa o de cualquier parte de el,
formando as&iacute; un trabajo basado en el Programa, y copiar y
distribuir
tales modificaciones o bi&eacute;n trabajar bajo los
t&eacute;rminos de la secci&oacute;n 1
arriba descrita, siempre que cumpla con las siguientes condiciones:
</font></font></p>

<p>
</p>

<ol type="A">

  <font face="Verdana" size="1"><font face="Verdana" size="2"> <li> Usted debe
incluir en los archivos modificados notas declarando que
modific&oacute; dichos archivos y la fecha de los cambios. </li>

  <li>Usted debe notificar que ese trabajo que distribuye
contiene totalmente
o en partes al Programa, y que debe ser licenciado como un conjunto sin
cargo alguno a cualquier otra persona que reciba sus modificaciones
bajo los t&eacute;rminos de esta Licencia. </li>

  <li> Si el programa modificado lee normalmente comandos
interactivamente cuando es ejecutado, usted debe presentar un aviso,
cuando el programa inicie su ejecuci&oacute;n en ese modo
interactivo de la
forma m&aacute;s ordinaria, que contenga una noticia de derechos de
autor y un
aviso de que no existe garant&iacute;a alguna (o que s&iacute;
existe si es que usted
la proporciona) y que los usuarios pueden redistribuir el programa bajo
esas condiciones, e informando al usuario como puede ver una copia de
esta Licencia. (Excepci&oacute;n: si el programa en s&iacute;
es interactivo pero
normalmente no muestra notas, su trabajo basado en el Programa no tiene
la obligaci&oacute;n de mostrar tales notas) </li>

  </font></font>
</ol>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Estos
requerimientos aplican al trabajo modificado como un todo. Si existen
secciones identificables de tal trabajo que no son derivadas del
Programa original, y pueden ser razonablemente consideradas trabajos
separados e independientes como tal, entonces esta Licencia y sus
t&eacute;rminos no aplican a dichas secciones cuando usted las
distribuye como
trabajos separados. Pero cuando usted distribuye las mismas secciones
como parte de un todo que es un trabajo basado en el Programa, la
distribuci&oacute;n del conjunto debe ser bajo los
t&eacute;rminos de esta Licencia,
cuyos permisos para otras personas que obtengan el software se
extienden para todo el software, as&iacute; como para cada parte de
el,
independientemente de qui&eacute;n lo escribi&oacute;.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">No es la
intenci&oacute;n de esta secci&oacute;n de reclamar derechos o
pelear sus derechos
sobre trabajos hechos enteramente por usted, en lugar de eso, la
intenci&oacute;n es ejercer el derecho de controlar la
distribuci&oacute;n de los
trabajos derivados o colectivos basados en el Programa.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Adicionalmente,
el simple agregado de otro trabajo NO basado en el Programa al Programa
en cuesti&oacute;n (o a un trabajo basado en el Programa) en
alg&uacute;n medio de
almacenamiento no pone el otro trabajo bajo el alcance de esta
Licencia.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><font size="4"><b>3.</b></font>
Usted puede copiar y distribuir el Programa (o un trabajo basado en
&eacute;l,
bajo la Secci&oacute;n 2) en c&oacute;digo objeto o en forma de
ejecutable najo los
t&eacute;rminos de las secciones 1 y 2 arriba descritas siempre que
cumpla los
siguientes requisitos:
</font></font></p>

<ol type="A">

  <font face="Verdana" size="1"><font face="Verdana" size="2"> <li>Acompa&ntilde;arlo
con el correspondiente c&oacute;digo fuente legible por la
m&aacute;quina, que debe ser distribu&iacute;do bajo los
t&eacute;rminos de las secciones 1
y 2 y en un medio comunmente utilizado para el intercambio de software,
o </li>

  <li> Acompa&ntilde;arlo con una oferta escrita,
v&aacute;lida por al menos 3
a&ntilde;os y para cualquier persona, por un cargo no mayor al
costo que
conlleve la distribuci&oacute;n f&iacute;sica del
c&oacute;digo fuente correspondiente en un
medio comunmente utilizado para el intercambio de software, o </li>

  <li> Acompa&ntilde;arlo con la informaci&oacute;n que
usted recibi&oacute; sobre la
oferta de distribuci&oacute;n del c&oacute;digo fuente
correspondiente. (Esta
alternativa est&aacute; permitida s&oacute;lo para
distribuci&oacute;n no-comercial y s&oacute;lo
si usted recibi&oacute; el Programa en c&oacute;digo objeto o
en forma de ejecutable
con tal oferta de acuerdo a la subsecci&oacute;n b anterior) </li>

  </font></font>
</ol>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">El c&oacute;digo
fuente de un trabajo significa la forma preferida de hacer
modificaciones al mismo. Para un trabajo ejecutable, un
c&oacute;digo fuente
completo significa todo el c&oacute;digo fuente de todos los
m&oacute;dulos que
contiene, mas cualquier archivo de definici&oacute;n de interfases,
mas los
programas utilizados para controlas la compilaci&oacute;n y la
instalaci&oacute;n del
ejecutable.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Sinembargo, como
excepci&oacute;n especial, no se requiere que el c&oacute;digo
fuente distribu&iacute;do incluya cualquier cosa que no sea
normalmente
distribu&iacute;da con las componentes mayores (compilador, kernel,
etc.)
del sistema operativo en el cual el ejecutable corre, a menos de que
una componente en particular acompa&ntilde;e al ejecutable.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Si la
distribuci&oacute;n del ejecutable o del c&oacute;digo objeto
se hace ofreciendo
acceso a copiar desde un lugar designado, entonces el ofrecer acceso
equivalente para copiar el c&oacute;digo fuente desde el mismo
lugar se
considera distribuci&oacute;n del c&oacute;digo fuente, aunque
las dem&aacute;s personas no
copien el c&oacute;digo fuente junto con el c&oacute;digo
objeto.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><font size="4"><b>4.</b></font>
Usted no puede copiar, modificar, sub-licenciar ni distribuir el
Programa a menos que sea expresamente bajo esta Licencia, de otra forma
cualquier intento de copiar, modificar, sub-licenciar o distribuir el
programa es nulo, y autom&aacute;ticamente causar&aacute; la
p&eacute;rdida de sus derechos
bajo esta Licencia. Sin embargo, cualquier persona que haya recibido
copias o derechos de usted bajo esta Licencia no ver&aacute;n
terminadas sus
Licencias ni sus derechos perdidos mientras ellas contin&uacute;en
cumpliendo
los t&eacute;rminos de esta Licencia.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><font size="4"><b>5.</b></font>
Usted no est&aacute; obligado a aceptar esta Licencia, dado que no
la ha
firmado. Sin embargo, nada le otorga el permiso de modificar o
distribuir el Programa ni sus trabajos derivados. Estas acciones
est&aacute;n
prohibidas por la ley si usted no acepta esta Licencia. Sin embargo,
modificando o distribuyendo el Programa (o cualquier trabajo basado en
el Programa) indica su aceptaci&oacute;n de esta Licencia y de
todos sus
t&eacute;rminos y condiciones para copiar, distribuir o modificar
el Programa
y/o trabajos basados en el.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><font size="4"><b>6.</b></font>
Cada vez que usted redistribuye el Programa (o cualquier trabajo basado
en el Programa), la persona que lo recibe autom&aacute;ticamente
recibe una
licencia del autor original para copiar, distribuir o modificar el
Programa sujeto a estos t&eacute;rminos y condiciones. Usted no
puede imponer
ninguna restricci&oacute;n adicional a las personas que reciban el
Programa
sobre los derechos que en esta Licencia se les otorga. Usted no es
responsable de forzar a terceras personas en el cumplimiento de esta
Licencia.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><font size="4"><b>7.</b></font>
Si como consecuencia de un veredicto de un juzgado o por el alegato de
infringir una patente o por cualquier otra raz&oacute;n (no
limitado solo a
cuestiones de patentes) se imponen condiciones sobre usted que
contradigan los t&eacute;rminos y condiciones de esta Licencia,
&eacute;stas no le
excusan de los t&eacute;rminos y condiciones aqu&iacute;
descritos. Si usted no puede
distribuir el producto cumpliendo totalmente con las obligaciones
concernientes a la resoluci&oacute;n oficial y al mismo tiempo con
las
obligaciones que se describen en este contrato de Licencia, entonces no
podr&aacute; distribuir m&aacute;s este producto. Por ejemplo,
si una licencia de
patente no permitir&aacute; la distribuci&oacute;n del Programa
de forma libre de
regal&iacute;as (sin pago de regal&iacute;as) por parte de
quienes lo reciban directa
o indirectamente, entonces la &uacute;nica forma de cumplir con
ambas
obligaciones es renunciar a la distribuci&oacute;n del mismo.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Si
cualquier parte de esta secci&oacute;n resulta inv&aacute;lida,
inaplicable o no
obligatoria bajo cualquier circunstancia en particular, la tendencia de
esta es a aplicarse, y la secci&oacute;n completa se
aplicar&aacute; bajo otras
circunstancias.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">La
intenci&oacute;n de esta secci&oacute;n no es la de inducirlo a
infringir ninguna ley
de patentes, ni tampoco infringir alg&uacute;n reclamo de derechos,
ni
discutir la validez de tales reclamos; esta secci&oacute;n tiene el
&uacute;nico
prop&oacute;sito de proteger la integridad del sistema de
distribuci&oacute;n del
software libre, que est&aacute; implementado por
pr&aacute;cticas de licencia
p&uacute;blica. Mucha gente ha hecho generosas contribuciones a la
amplia gama
de software distribuido bajo este sistema favoreciendo as&iacute;
la constante
aplicaci&oacute;n de este sistema de distribuci&oacute;n; es
decisi&oacute;n del
autor/donador si su Programa ser&aacute; distribu&iacute;do
utilizando este u otro
sistema de distribuci&oacute;n, y la persona que recibe el software
no puede
obligarlo a hacer ninguna elecci&oacute;n en particular.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Esta secci&oacute;n
pretende dejar muy en claro lo que se cree que ser&aacute; una
consecuencia del resto de esta Licencia.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><font size="4"><b>8.</b></font>
Si la distribuci&oacute;n y/o el uso del Programa se restringe a
algunos
pa&iacute;ses ya sea por patentes, interfases protegidas por
derechos de
autor, el propietario original de los derechos de autor que ubica su
Programa bajo esta Licencia puede agregar una restricci&oacute;n
geogr&aacute;fica de
distribuci&oacute;n expl&iacute;cita excluyendo los
pa&iacute;ses que aplique, dando como
resultado que su distribuci&oacute;n s&oacute;lo se permita en
los pa&iacute;ses no
exclu&iacute;dos. En tal caso, esta Licencia incorpora la
limitaci&oacute;n como si
hubiera sido escrita en el cuerpo de esta misma Licencia.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><font size="4"><b>9.</b></font>
La "FSF Free Software Foundation" puede publicar versiones nuevas o
revisadas de la "GPL General Public License" de uno a otro momento.
Estas nuevas versiones mantendr&aacute;n el esp&iacute;ritu de
la presente versi&oacute;n,
pero pueden diferir en la inclusi&oacute;n de nuevos problemas o en
la manera
de tocar los problemas o aspectos ya presentes.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Cada
versi&oacute;n tendr&aacute; un n&uacute;mero de
versi&oacute;n que la distinga. Si el Programa
especifica un n&uacute;mero de versi&oacute;n para esta
Licencia que aplique a &eacute;l y
"cualquier versi&oacute;n subsecuente", usted tiene la
opci&oacute;n de seguir los
t&eacute;rminos y condiciones de dicha versi&oacute;n o de
cualquiera de las
posteriores versiones publicadas por la "FSF". Si el programa no
especifica una versi&oacute;n en especial de esta Licencia, usted
puede elegir
entre cualquiera de las versiones que han sido publicadas por la "FSF".
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><font size="4"><b>10.</b></font>
Si usted desea incorporar partes del Programa en otros Programas de
software libre cuyas condiciones de distribuci&oacute;n sean
distintas, deber&aacute;
escribir al autor solicitando su autorizaci&oacute;n. Para
programas de
software protegidas por la "FSF Free Software Foundation",
deber&aacute;
escribir a la "FSF" solicitando autorizaci&oacute;n, en ocasiones
hacemos
excepciones. Nuestra decisi&oacute;n ser&aacute; guiada por dos
metas principales:
</font></font></p>

<ul>

  <font face="Verdana" size="1"><font face="Verdana" size="2"> <li> mantener el
estado de libertad de todos los derivados de nuestro software libre </li>

  <li> promover el uso comunitario y compartido del software en
general </li>

  </font></font>
</ul>

<p><font face="Verdana" size="1"><font face="Verdana" size="2"><br>

<br>

</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><font size="3"><b>NO
EXISTE GARANTIA ALGUNA</b></font>
</font></font></p>

<hr>
<p><font face="Verdana" size="1"><font face="Verdana" size="2"><font size="4"><b>11.</b></font>
DEBIDO A QUE EL PROGRAMA SE OTORGA LIBRE DE CARGOS Y REGALIAS, NO
EXISTE NINGUNA GARANTIA PARA EL MISMO HASTA DONDE LO PERMITA LA LEY
APLICABLE. A EXCEPCION DE QUE SE INDIQUE OTRA COSA, LOS PROPIETARIOS DE
LOS DERECHOS DE AUTOR PROPORCIONAN EL PROGRAMA "COMO ES" SIN NINGUNA
GARANTIA DE NINGUN TIPO, YA SEA EXPLICITA O IMPLICITA, INCLUYENDO, PERO
NO LIMITADA A, LAS GARANTIAS QUE IMPLICA EL MERCADEO Y EJERCICIO DE UN
PROPOSITO EN PARTICULAR. CUALQUIER RIESGO DEBIDO A LA CALIDAD Y
DESEMPE&Ntilde;O DEL PROGRAMA ES TOMADO COMPLETAMENTE POR USTED. SI
EL
SOFTWARE MUESTRA ALGUN DEFECTO, USTED CUBRIRA LOS COSTOS DE CUALQUIER
SERVICIO, REPARACION O CORRECCION DE SUS EQUIPOS Y/O SOFTWARE QUE
REQUIERA.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><font size="4"><b>12.</b></font>
EN NINGUN CASO NI BAJO NINGUNA CIRCUNSTANCIA EXCEPTO BAJO SOLICITUD DE
LA LEY O DE COMUN ACUERDO POR ESCRITO, NINGUN PROPIETARIO DE LOS
DERECHOS DE AUTOR NI TERCERAS PERSONAS QUE PUDIERAN MODIFICAR Y/O
REDISTRIBUIR EL PROGRAMA COMO SE PERMITE ARRIBA, SERAN RESPONSABLES DE
LOS DA&Ntilde;OS CORRESPONDIENTES AL USO O IMPOSIBILIDAD DE USAR EL
PROGRAMA,
SIN IMPORTAR SI SON DA&Ntilde;OS GENERALES, ESPECIALES,
INCIDENTALES O
CONSEQUENTES CORRESPONDIENTES AL USO O IMPOSIBILIDAD DE USAR EL
PROGRAMA (INCLUYENDO PERO NO LIMITADO A LA PERDIDA DE INFORMACION O
DETERIORO DE LA MISMA AFECTANDOLO A USTED, A TERCERAS PERSONAS QUE SEA
POR FALLAS EN LA OPERACION DEL PROGRAMA O SU INTERACCION CON OTROS
PROGRAMAS) INCLUSIVE SI TAL PROPIETARIO U OTRAS PERSONAS HAYAN SIDO
NOTIFICADAS DE TALES FALLAS Y DE LA POSIBILIDAD DE TALES
DA&Ntilde;OS.
</font></font></p>

<p>
</p>

<hr>
<font face="Verdana" size="1"><font face="Verdana" size="2"><font size="3"><b>FIN
DE TERMINOS Y CONDICIONES</b></font>
</font></font>
<p><font face="Verdana" size="1"><font face="Verdana" size="2"><br>

<br>

<br>

<br>

</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2"><a name="aplicacion"></a><font size="3"><b>C&oacute;mo aplicar estos
t&eacute;rminos a sus nuevos programas?</b></font>
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Si usted
desarrolla un nuevo Programa y desea que sea lo m&aacute;s
p&uacute;blico posible, el
mejor modo de hacerlo es haciendolo Software Libre donde toda persona
lo puede redistribui y cambiar bajo estos t&eacute;rminos.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Para hacer
esto, agregue las siguientes notas al programa. Es m&aacute;s
seguro
agregarlas al inicio de cada archivo del c&oacute;digo fuente para
notificar
de manera m&aacute;s efectiva la ausencia de garant&iacute;a; y
cada archivo debe de
contener al menos la l&iacute;nea de "Copyright" o derechos de
autor y una
referencia de donde se puede encontrar la nota completa.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">ejemplo:
</font></font></p>

<p>
</p>

<dir>
<pre><font face="Verdana" size="1"><font face="Verdana" size="2"><font size="3"><i>esta l&iacute;nea que contenga el nombre del programa y una idea de lo que hace.<br>Copyright (C) A&Ntilde;O nombre del autor<br><br>Este programa es Software Libre; usted puede redistribuirlo<br>y/o modificarlo bajo los t&eacute;rminos de la "GNU General Public<br>License" como lo publica la "FSF Free Software Foundation",<br>o (a su elecci&oacute;n) de cualquier versi&oacute;n posterior.<br><br>Este programa es distribuido con la esperanza de que le ser&aacute;<br>&uacute;til, pero SIN NINGUNA GARANTIA; incluso sin la garant&iacute;a<br>impl&iacute;cita por el MERCADEO o EJERCICIO DE ALGUN PROPOSITO en<br>particular. Vea la "GNU General Public License" para m&aacute;s<br>detalles.<br><br>Usted debe haber recibido una copia de la "GNU General Public<br>License" junto con este programa, si no, escriba a la "FSF<br>Free Software Foundation, Inc.", 59 Temple Place - Suite 330,<br>Boston, MA 02111-1307, USA.<br></i></font></font></font></pre>

</dir>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Adicionalmente agregue
informaci&oacute;n de c&oacute;mo contactarle por correo
electr&oacute;nico y convencional.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Si el programa es
interactivo, ponga en la salida del programa una nota corta al iniciar
el modo interactivo:
</font></font></p>

<p>
</p>

<dir>
<pre><font face="Verdana" size="1"><font face="Verdana" size="2"><font size="3"><i>Gnomovision version 69, Copyright (C) A&Ntilde;O nombre del autor<br>Gnomovision no tiene NINGUNA GARANTIA, para m&aacute;s detalles<br>escriba 'show w'. Este es Software Libre, y usted est&aacute;<br>permitido para redistribuirlo bajo ciertas condiciones;<br>escriba 'show c' para m&aacute;s detalles.<br></i></font></font></font></pre>

</dir>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Estos
supuestos comandos 'show w' y 'show c' deber&aacute;n mostrar las
partes
apropiadas de la "GPL General Public License". Por supuesto, los
comandos que utilice pueden ser distintos, pueden ser incluso "clicks"
del rat&oacute;n, opciones de men&uacute;s etc, lo
m&aacute;s apropiado para su programa.
</font></font></p>

<p>
<font face="Verdana" size="1"><font face="Verdana" size="2">Usted
deber&iacute;a hacer que su jefe de proyecto (si trabaja como
programador) o
su escuela, si aplica, firme una "declaraci&oacute;n de derechos de
autor"
para el programa, si se necesita. Aqu&iacute; hay un ejemplo,
modifique los
nombres:
</font></font></p>

<p>
</p>

<dir>
<pre><font face="Verdana" size="1"><font face="Verdana" size="2"><font size="3"><i>Yoyodyne, Inc., aqu&iacute; vienen las declaraciones de derechos de autor<br>inter&eacute;s en el programa 'Gnomovision'<br>(lo que make pasa al compilador)<br>escrito por James Hacker.<br><br>firma de Ty Coon, 1 de Abril 1989<br>Ty Coon, Presidente<br></i></font></font></font></pre>

</dir>

<font face="Verdana" size="1"><font face="Verdana" size="2">Esta
Licencia P&uacute;blica General no permite incorporar su programa
en programas
propietarios. Si su programa es una librer&iacute;a de subrutinas,
puede ser
m&aacute;s &uacute;til permitir que se ligue en tiempo de
compilaci&oacute;n o ejecuci&oacute;n a
aplicaciones propietarias. Si esto es lo que quiere hacer, use la
licencia P&uacute;blica General para Librer&iacute;as en lugar
de esta licencia.
</font></font>
</body>
</html>
